examples/inference-performance/inferdrome-p1/sources/native-p95-under-20ms.yaml
schema_version: inferdrome.source-experiment.v1
experiment:
  id: inferdrome-p1-native-p95-under-20ms
  title: Pinned Qwen2.5 0.5B managed-vLLM real-GPU proof
  hypothesis: A clean NVIDIA host can reproduce one sealed Inferdrome bundle.
execution:
  mode: attached_endpoint
  max_runtime_seconds: 900
  max_measured_requests: 100
target:
  engine: vllm
  endpoint: http://127.0.0.1:18080
  model: Qwen/Qwen2.5-0.5B-Instruct
  model_revision: 7ae557604adf67be50417f59c2c2f167def9a775
  tokenizer_revision: 7ae557604adf67be50417f59c2c2f167def9a775
  engine_version: 0.26.0
workload:
  path: real-gpu/workload.jsonl
  sha256: sha256:22bf3389cc29ee946ae567870d7f8d7b458594224542a796e8990c15b1cfcd63
  prompt_content_policy: include
  requested_output_tokens: 32
  temperature: 0
  seed: 42
traffic:
  kind: concurrent
  concurrency: 4
  warmup_requests: 10
  measured_requests: 100
evidence:
  canonical_response_content: omit
links:
  exitspec_contract_digest: sha256:c73f3fe1127575443bc30baa1cac4a610dfebfcd721ac72a2c998a6bf1c21580